<a href="https://colab.research.google.com/github/Jagannath8/GoeduHub-Training/blob/main/Assignment_5.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **GO_STP_579 -> Jagannath Pal**

# ***Assignment_4***

---

# Pandas - Data Analysis of IMDB movies data
As we have a basic understanding of the different data structures in Pandas, let’s explore the fun and interesting ‘IMDB-movies-dataset’ and get our hands dirty by performing practical data analysis on real data.


It is an open-source dataset and you can download it from this link.

We will read the data from the .csv file and perform the following basic operations on movies data

# 1. Load the IMDb Dataset and read

In [2]:
import numpy as np
import pandas as pd
df = pd.DataFrame()
df = pd.read_csv("IMDB-Movie-Data.csv")



---

# 2. View the dataset

In [3]:
df

     Rank                    Title  ... Revenue (Millions) Metascore
0       1  Guardians of the Galaxy  ...             333.13      76.0
1       2               Prometheus  ...             126.46      65.0
2       3                    Split  ...             138.12      62.0
3       4                     Sing  ...             270.32      59.0
4       5            Suicide Squad  ...             325.02      40.0
..    ...                      ...  ...                ...       ...
995   996     Secret in Their Eyes  ...                NaN      45.0
996   997          Hostel: Part II  ...              17.54      46.0
997   998   Step Up 2: The Streets  ...              58.01      50.0
998   999             Search Party  ...                NaN      22.0
999  1000               Nine Lives  ...              19.64      11.0

[1000 rows x 12 columns]



---

# 3. Understand some basic information about the dataset and Inspect the dataframe Inspect the dataframe's columns, shapes, variable types etc.

In [4]:
df.ndim

2

In [5]:
df.shape

(1000, 12)

In [6]:
df.size

12000

In [7]:
df.dtypes

Rank                    int64
Title                  object
Genre                  object
Description            object
Director               object
Actors                 object
Year                    int64
Runtime (Minutes)       int64
Rating                float64
Votes                   int64
Revenue (Millions)    float64
Metascore             float64
dtype: object

In [8]:
df.columns

Index(['Rank', 'Title', 'Genre', 'Description', 'Director', 'Actors', 'Year',
       'Runtime (Minutes)', 'Rating', 'Votes', 'Revenue (Millions)',
       'Metascore'],
      dtype='object')

In [9]:
df.axes

[RangeIndex(start=0, stop=1000, step=1),
 Index(['Rank', 'Title', 'Genre', 'Description', 'Director', 'Actors', 'Year',
        'Runtime (Minutes)', 'Rating', 'Votes', 'Revenue (Millions)',
        'Metascore'],
       dtype='object')]

In [10]:
type(df)

pandas.core.frame.DataFrame

In [11]:
df.values

array([[1, 'Guardians of the Galaxy', 'Action,Adventure,Sci-Fi', ...,
        757074, 333.13, 76.0],
       [2, 'Prometheus', 'Adventure,Mystery,Sci-Fi', ..., 485820, 126.46,
        65.0],
       [3, 'Split', 'Horror,Thriller', ..., 157606, 138.12, 62.0],
       ...,
       [998, 'Step Up 2: The Streets', 'Drama,Music,Romance', ..., 70699,
        58.01, 50.0],
       [999, 'Search Party', 'Adventure,Comedy', ..., 4881, nan, 22.0],
       [1000, 'Nine Lives', 'Comedy,Family,Fantasy', ..., 12435, 19.64,
        11.0]], dtype=object)

In [12]:
df.describe()

              Rank         Year  ...  Revenue (Millions)   Metascore
count  1000.000000  1000.000000  ...          872.000000  936.000000
mean    500.500000  2012.783000  ...           82.956376   58.985043
std     288.819436     3.205962  ...          103.253540   17.194757
min       1.000000  2006.000000  ...            0.000000   11.000000
25%     250.750000  2010.000000  ...           13.270000   47.000000
50%     500.500000  2014.000000  ...           47.985000   59.500000
75%     750.250000  2016.000000  ...          113.715000   72.000000
max    1000.000000  2016.000000  ...          936.630000  100.000000

[8 rows x 7 columns]

In [13]:
df.nunique

<bound method DataFrame.nunique of      Rank                    Title  ... Revenue (Millions) Metascore
0       1  Guardians of the Galaxy  ...             333.13      76.0
1       2               Prometheus  ...             126.46      65.0
2       3                    Split  ...             138.12      62.0
3       4                     Sing  ...             270.32      59.0
4       5            Suicide Squad  ...             325.02      40.0
..    ...                      ...  ...                ...       ...
995   996     Secret in Their Eyes  ...                NaN      45.0
996   997          Hostel: Part II  ...              17.54      46.0
997   998   Step Up 2: The Streets  ...              58.01      50.0
998   999             Search Party  ...                NaN      22.0
999  1000               Nine Lives  ...              19.64      11.0

[1000 rows x 12 columns]>



---

# 4. Data Selection – Indexing and Slicing data

In [14]:
df['Title']

0      Guardians of the Galaxy
1                   Prometheus
2                        Split
3                         Sing
4                Suicide Squad
                ...
995       Secret in Their Eyes
996            Hostel: Part II
997     Step Up 2: The Streets
998               Search Party
999                 Nine Lives
Name: Title, Length: 1000, dtype: object

In [15]:
df.iloc[: ,8]

0      8.1
1      7.0
2      7.3
3      7.2
4      6.2
      ...
995    6.2
996    5.5
997    6.2
998    5.6
999    5.3
Name: Rating, Length: 1000, dtype: float64

In [16]:
df.loc[:, "Rank" : "Year"]

     Rank  ...  Year
0       1  ...  2014
1       2  ...  2012
2       3  ...  2016
3       4  ...  2016
4       5  ...  2016
..    ...  ...   ...
995   996  ...  2015
996   997  ...  2007
997   998  ...  2008
998   999  ...  2014
999  1000  ...  2016

[1000 rows x 7 columns]

In [17]:
df.iloc[:,1:5]

                       Title  ...              Director
0    Guardians of the Galaxy  ...            James Gunn
1                 Prometheus  ...          Ridley Scott
2                      Split  ...    M. Night Shyamalan
3                       Sing  ...  Christophe Lourdelet
4              Suicide Squad  ...            David Ayer
..                       ...  ...                   ...
995     Secret in Their Eyes  ...             Billy Ray
996          Hostel: Part II  ...              Eli Roth
997   Step Up 2: The Streets  ...            Jon M. Chu
998             Search Party  ...        Scot Armstrong
999               Nine Lives  ...      Barry Sonnenfeld

[1000 rows x 4 columns]



---

# 5. Data Selection – Based on Conditional filtering

In [18]:
df['Rating']>8
df_sub = df[df['Rating']>8]
df_sub.head(10)

    Rank  ... Metascore
0      1  ...      76.0
6      7  ...      93.0
16    17  ...      71.0
18    19  ...      69.0
26    27  ...       NaN
36    37  ...      74.0
50    51  ...      81.0
54    55  ...      82.0
64    65  ...      66.0
67    68  ...      90.0

[10 rows x 12 columns]



---

# 6. Groupby operations

In [19]:
df.groupby(['Year', 'Title'])['Rating'].count()

Year  Title
2006  300                   1
      A Good Year           1
      Apocalypto            1
      Babel                 1
      Blood Diamond         1
                           ..
2016  Wolves at the Door    1
      X-Men: Apocalypse     1
      Yoga Hosers           1
      Zoolander 2           1
      Zootopia              1
Name: Rating, Length: 1000, dtype: int64

In [20]:
df.groupby(["Genre", "Year"])["Rating"].mean()

Genre                       Year
Action                      2016    6.150000
Action,Adventure            2007    6.200000
                            2012    7.000000
                            2014    6.000000
Action,Adventure,Biography  2015    6.900000
                                      ...
Sci-Fi,Thriller             2008    5.000000
Thriller                    2007    7.100000
                            2014    6.700000
                            2016    5.685714
Thriller,War                2016    6.000000
Name: Rating, Length: 583, dtype: float64

In [21]:
df.groupby('Votes').sum()

         Rank  Year  Runtime (Minutes)  Rating  Revenue (Millions)  Metascore
Votes
61        479  2016                 96     8.3                0.00       71.0
96        294  2016                107     7.7                0.00        0.0
102       394  2016                 98     5.0                0.00       43.0
115       338  2016                 88     5.9                0.00       64.0
164       417  2016                108     6.9                0.00       85.0
...       ...   ...                ...     ...                 ...        ...
1045588    77  2012                143     8.1              623.28       69.0
1047747    37  2014                169     8.6              187.99       74.0
1222645   125  2012                164     8.5              448.13       78.0
1583625    81  2010                148     8.8              292.57       74.0
1791916    55  2008                152     9.0              533.32       82.0

[997 rows x 6 columns]



---

# 7. Sorting operation

In [22]:
df_sorted = df.sort_values(by='Actors')
df_sorted.head()

     Rank           Title  ... Revenue (Millions) Metascore
765   766              PK  ...              10.57      51.0
430   431        3 Idiots  ...               6.52      67.0
117   118          Dangal  ...              11.15       NaN
535   536  Need for Speed  ...              43.57      39.0
97     98        The Void  ...               0.15      62.0

[5 rows x 12 columns]

In [23]:
df_sorted = df.sort_index(ascending=True)
df_sorted.tail()

     Rank                   Title  ... Revenue (Millions) Metascore
995   996    Secret in Their Eyes  ...                NaN      45.0
996   997         Hostel: Part II  ...              17.54      46.0
997   998  Step Up 2: The Streets  ...              58.01      50.0
998   999            Search Party  ...                NaN      22.0
999  1000              Nine Lives  ...              19.64      11.0

[5 rows x 12 columns]



---

# 8. Dealing with missing values

In [24]:
df.count()

Rank                  1000
Title                 1000
Genre                 1000
Description           1000
Director              1000
Actors                1000
Year                  1000
Runtime (Minutes)     1000
Rating                1000
Votes                 1000
Revenue (Millions)     872
Metascore              936
dtype: int64



---

# 9. Dropping columns and null values

In [25]:
df.drop('Metascore',axis = 1,inplace=True)
df.head()

   Rank                    Title  ...   Votes Revenue (Millions)
0     1  Guardians of the Galaxy  ...  757074             333.13
1     2               Prometheus  ...  485820             126.46
2     3                    Split  ...  157606             138.12
3     4                     Sing  ...   60545             270.32
4     5            Suicide Squad  ...  393727             325.02

[5 rows x 11 columns]

In [26]:
df.dropna(inplace=True)
df.isna().sum()

Rank                  0
Title                 0
Genre                 0
Description           0
Director              0
Actors                0
Year                  0
Runtime (Minutes)     0
Rating                0
Votes                 0
Revenue (Millions)    0
dtype: int64



---

# 10. Apply( ) functions

In [31]:
df['Revenue (Millions)'].apply(np.sum)

0      333.13
1      126.46
2      138.12
3      270.32
4      325.02
        ...
993     60.13
994     54.72
996     17.54
997     58.01
999     19.64
Name: Revenue (Millions), Length: 872, dtype: float64



---